# 07. Select Data (loc)
Select a data(from specified row and column) by name

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('score.xlsx', index_col='지원번호')
df

       이름   학교    키   국어   영어   수학  과학  사회        SW특기
지원번호
1     채치수  북산고  197   90   85  100  95  85      Python
2     정대만  북산고  184   40   35   50  55  25        Java
3     송태섭  북산고  168   80   75   70  80  75  Javascript
4     서태웅  북산고  187   40   60   70  75  80         NaN
5     강백호  북산고  188   15   20   10  35  10         NaN
6     변덕규  능남고  202   80  100   95  85  80           C
7     황태산  능남고  188   55   65   45  40  35      PYTHON
8     윤대협  능남고  190  100   85   90  95  95          C#

In [6]:
df.loc[5] # select a row with an index '5' (note: index could be any string)

이름      강백호
학교      북산고
키       188
국어       15
영어       20
수학       10
과학       35
사회       10
SW특기    NaN
Name: 5, dtype: object

In [8]:
df.loc[1, '국어'] # first student's 국어 data

90

In [11]:
df.loc[[2, 5], '영어'] # grab the second and fifth students' 영어 data

지원번호
2    35
5    20
Name: 영어, dtype: int64

In [22]:
df.loc[[1, 2, 3, 4, 5], ['국어', '영어', '수학']]

      국어  영어   수학
지원번호
1     90  85  100
2     40  35   50
3     80  75   70
4     40  60   70
5     15  20   10

In [23]:
# df.loc['1번':'3번', '국어':'사회]